Revit 2024 API
BuiltInFailures.StairRampFailures.SpiralRunRadiusTooSmallFailure Property
 The radius value for the run is too small.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpiralRunRadiusTooSmallFailure { get; }
Visual Basic
Public Shared ReadOnly Property SpiralRunRadiusTooSmallFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpiralRunRadiusTooSmallFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace